In [1]:
import pandas as pd
import numpy as np

In [2]:
fname = ['Paul', 'John', 'Richard', 'George']

In [3]:
lname = ['McCartney', 'Lennon', 'Starkey', 'Harrison']

In [4]:
birth = [1941, 1940, 1940, 1943]

In [5]:
people = {'first': fname, 'last': lname, 'birth': birth}

In [6]:
beatles = pd.DataFrame(people)
beatles

     first       last  birth
0     Paul  McCartney   1941
1     John     Lennon   1940
2  Richard    Starkey   1940
3   George   Harrison   1943

In [7]:
beatles.index

RangeIndex(start=0, stop=4, step=1)

In [8]:
pd.DataFrame(people, index=['a', 'b', 'c', 'd'])

     first       last  birth
a     Paul  McCartney   1941
b     John     Lennon   1940
c  Richard    Starkey   1940
d   George   Harrison   1943

In [9]:
pd.DataFrame(
    [{"first": "Paul", "last": "McCartney", "birth": 1942},
     {"first": "John", "last": "Lennon", "birth": 1940},
     {"first": "Richard", "last": "Starkey", "birth": 1940},
     {"first": "George", "last": "Harrison", "birth": 1943}])

     first       last  birth
0     Paul  McCartney   1942
1     John     Lennon   1940
2  Richard    Starkey   1940
3   George   Harrison   1943

In [10]:
pd.DataFrame(
    [{"first": "Paul", "last": "McCartney", "birth": 1942},
     {"first": "John", "last": "Lennon", "birth": 1940},
     {"first": "Richard", "last": "Starkey", "birth": 1940},
     {"first": "George", "last": "Harrison", "birth": 1943}],
    columns=['last', 'first', 'birth'])

        last    first  birth
0  McCartney     Paul   1942
1     Lennon     John   1940
2    Starkey  Richard   1940
3   Harrison   George   1943

CSV 작성

In [11]:
from io import StringIO

In [12]:
fout = StringIO()

In [13]:
beatles.to_csv(fout)

In [14]:
print(fout.getvalue())

,first,last,birth
0,Paul,McCartney,1941
1,John,Lennon,1940
2,Richard,Starkey,1940
3,George,Harrison,1943

In [17]:
_ = fout.seek(0)
pd.read_csv(fout)

   Unnamed: 0    first       last  birth
0           0     Paul  McCartney   1941
1           1     John     Lennon   1940
2           2  Richard    Starkey   1940
3           3   George   Harrison   1943

In [18]:
_ = fout.seek(0)
pd.read_csv(fout, index_col=0)

     first       last  birth
0     Paul  McCartney   1941
1     John     Lennon   1940
2  Richard    Starkey   1940
3   George   Harrison   1943

In [19]:
fout = StringIO()

In [20]:
beatles.to_csv(fout, index=False)

In [21]:
print(fout.getvalue())

first,last,birth
Paul,McCartney,1941
John,Lennon,1940
Richard,Starkey,1940
George,Harrison,1943

대형 CSV 파일 읽기

In [22]:
diamonds = pd.read_csv('data/diamonds.csv', nrows=1000)

In [23]:
diamonds

     carat      cut color clarity  depth  table  price     x     y     z
0     0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1     0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
2     0.23     Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
3     0.29  Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4     0.31     Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75
..     ...      ...   ...     ...    ...    ...    ...   ...   ...   ...
995   0.54    Ideal     D    VVS2   61.4   52.0   2897  5.30  5.34  3.26
996   0.72    Ideal     E     SI1   62.5   55.0   2897  5.69  5.74  3.57
997   0.72     Good     F     VS1   59.4   61.0   2897  5.82  5.89  3.48
998   0.74  Premium     D     VS2   61.8   58.0   2897  5.81  5.77  3.58
999   1.12  Premium     J     SI2   60.6   59.0   2898  6.68  6.61  4.03

[1000 rows x 10 columns]

In [24]:
diamonds.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   carat    1000 non-null   float64
 1   cut      1000 non-null   object
 2   color    1000 non-null   object
 3   clarity  1000 non-null   object
 4   depth    1000 non-null   float64
 5   table    1000 non-null   float64
 6   price    1000 non-null   int64
 7   x        1000 non-null   float64
 8   y        1000 non-null   float64
 9   z        1000 non-null   float64
dtypes: float64(6), int64(1), object(3)
memory usage: 78.2+ KB

In [25]:
diamonds2 = pd.read_csv(
    'data/diamonds.csv',
    nrows=1000,
    dtype={
        'carat': np.float32,
        'depth': np.float32,
        'table': np.float32,
        'x': np.float32,
        'y': np.float32,
        'z': np.float32,
        'price': np.int16
    })

In [26]:
diamonds2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   carat    1000 non-null   float32
 1   cut      1000 non-null   object
 2   color    1000 non-null   object
 3   clarity  1000 non-null   object
 4   depth    1000 non-null   float32
 5   table    1000 non-null   float32
 6   price    1000 non-null   int16
 7   x        1000 non-null   float32
 8   y        1000 non-null   float32
 9   z        1000 non-null   float32
dtypes: float32(6), int16(1), object(3)
memory usage: 49.0+ KB

In [27]:
diamonds.describe()

,carat,depth,table,price,x,y,z
count,1000.000000,1000.000000,1000.000000,1000.00000,1000.000000,1000.000000,1000.000000
mean,0.689280,61.722800,57.734700,2476.54000,5.605940,5.599180,3.457530
std,0.195291,1.758879,2.467946,839.57562,0.625173,0.611974,0.389819
min,0.200000,53.000000,52.000000,326.00000,3.790000,3.750000,2.270000
25%,0.700000,60.900000,56.000000,2777.00000,5.640000,5.630000,3.450000
50%,0.710000,61.800000,57.000000,2818.00000,5.770000,5.760000,3.550000
75%,0.790000,62.600000,59.000000,2856.00000,5.920000,5.910000,3.640000
max,1.270000,69.500000,70.000000,2898.00000,7.120000,7.050000,4.330000

In [28]:
diamonds2.describe()

,carat,depth,table,price,x,y,z
count,1000.000000,1000.000000,1000.000000,1000.00000,1000.000000,1000.000000,1000.000000
mean,0.689280,61.722801,57.734699,2476.54000,5.605940,5.599180,3.457530
std,0.195291,1.758878,2.467944,839.57562,0.625173,0.611972,0.389819
min,0.200000,53.000000,52.000000,326.00000,3.790000,3.750000,2.270000
25%,0.700000,60.900002,56.000000,2777.00000,5.640000,5.630000,3.450000
50%,0.710000,61.799999,57.000000,2818.00000,5.770000,5.760000,3.550000
75%,0.790000,62.599998,59.000000,2856.00000,5.920000,5.910000,3.640000
max,1.270000,69.500000,70.000000,2898.00000,7.120000,7.050000,4.330000

In [29]:
diamonds2.cut.value_counts()

Ideal        333
Premium      290
Very Good    226
Good          89
Fair          62
Name: cut, dtype: int64

In [30]:
diamonds2.color.value_counts()

E    240
F    226
G    139
D    129
H    125
I     95
J     46
Name: color, dtype: int64

In [31]:
diamonds2.clarity.value_counts()

SI1     306
VS2     218
VS1     159
SI2     154
VVS2     62
VVS1     58
I1       29
IF       14
Name: clarity, dtype: int64

In [33]:
diamonds3 = pd.read_csv(
    'data/diamonds.csv',
    nrows=1000,
    dtype={
        'carat': np.float32,
        'depth': np.float32,
        'table': np.float32,
        'x': np.float32,
        'y': np.float32,
        'z': np.float32,
        'price': np.int16,
        'cut': 'category',
        'color': 'category',
        'clarity': 'category',
    }
)

In [34]:
diamonds3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   carat    1000 non-null   float32
 1   cut      1000 non-null   category
 2   color    1000 non-null   category
 3   clarity  1000 non-null   category
 4   depth    1000 non-null   float32
 5   table    1000 non-null   float32
 6   price    1000 non-null   int16
 7   x        1000 non-null   float32
 8   y        1000 non-null   float32
 9   z        1000 non-null   float32
dtypes: category(3), float32(6), int16(1)
memory usage: 29.4 KB

In [35]:
cols = [
    'carat', 'cut', 'color', 'clarity', 'depth', 'table', 'price'
]

In [38]:
diamonds4 = pd.read_csv(
    'data/diamonds.csv',
    nrows=1000,
    dtype={
        'carat': np.float32,
        'depth': np.float32,
        'table': np.float32,
        'price': np.int16,
        'cut': 'category',
        'color': 'category',
        'clarity': 'category',
    },
    usecols=cols
)

In [39]:
diamonds4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   carat    1000 non-null   float32
 1   cut      1000 non-null   category
 2   color    1000 non-null   category
 3   clarity  1000 non-null   category
 4   depth    1000 non-null   float32
 5   table    1000 non-null   float32
 6   price    1000 non-null   int16
dtypes: category(3), float32(3), int16(1)
memory usage: 17.6 KB

In [40]:
diamonds_iter = pd.read_csv(
    'data/diamonds.csv',
    nrows=1000,
    dtype={
        'carat': np.float32,
        'depth': np.float32,
        'table': np.float32,
        'price': np.int16,
        'cut': 'category',
        'color': 'category',
        'clarity': 'category',
    },
    usecols=cols,
    chunksize=200
)

In [41]:
def process(df):
    return f"processed {df.size} items"

In [42]:
for chunk in diamonds_iter:
    process(chunk)

In [43]:
np.iinfo(np.int8)

iinfo(min=-128, max=127, dtype=int8)

In [44]:
np.finfo(np.float16)

finfo(resolution=0.001, min=-6.55040e+04, max=6.55040e+04, dtype=float16)

In [45]:
diamonds.price.memory_usage()

8128

In [46]:
diamonds.price.memory_usage(index=False)

8000

In [47]:
diamonds.cut.memory_usage()

8128

In [48]:
diamonds.cut.memory_usage(deep=True)

63461

In [50]:
diamonds4.to_feather('d.arr')

In [51]:
diamonds5 = pd.read_feather('d.arr')

엑셀 파일 사용

In [52]:
beatles.to_excel('beat.xls')

/var/folders/j_/hylrqd052y9czkfmjyyc7n7r0000gn/T/ipykernel_7196/4277668329.py:1: FutureWarning: As the xlwt package is no longer maintained, the xlwt engine will be removed in a future version of pandas. This is the only engine in pandas that supports writing in the xls format. Install openpyxl and write to an xlsx file instead. You can set the option io.excel.xls.writer to 'xlwt' to silence this warning. While this option is deprecated and will also raise a warning, it can be globally set and the warning suppressed.
  beatles.to_excel('beat.xls')

In [53]:
beatles.to_excel('beat.xlsx')

In [55]:
beat2 = pd.read_excel('beat.xlsx')

In [57]:
beat2

   Unnamed: 0    first       last  birth
0           0     Paul  McCartney   1941
1           1     John     Lennon   1940
2           2  Richard    Starkey   1940
3           3   George   Harrison   1943

In [58]:
beat2 = pd.read_excel('beat.xlsx', index_col=0)

In [59]:
beat2

     first       last  birth
0     Paul  McCartney   1941
1     John     Lennon   1940
2  Richard    Starkey   1940
3   George   Harrison   1943

In [60]:
beat2.dtypes

first    object
last     object
birth     int64
dtype: object

ZIP 파일로 작업

In [61]:
autos = pd.read_csv('data/vehicles.csv.zip')

/var/folders/j_/hylrqd052y9czkfmjyyc7n7r0000gn/T/ipykernel_7196/158859249.py:1: DtypeWarning: Columns (70,71,72,73,74,76,79) have mixed types. Specify dtype option on import or set low_memory=False.
  autos = pd.read_csv('data/vehicles.csv.zip')

In [62]:
autos

,barrels08,barrelsA08,charge120,charge240,city08,city08U,cityA08,cityA08U,cityCD,cityE,...,mfrCode,c240Dscr,charge240b,c240bDscr,createdOn,modifiedOn,startStop,phevCity,phevHwy,phevComb
0,15.695714,0.0,0.0,0.0,19,0.0,0,0.0,0.0,0.0,...,NaN,NaN,0.0,NaN,Tue Jan 01 00:00:00 EST 2013,Tue Jan 01 00:00:00 EST 2013,NaN,0,0,0
1,29.964545,0.0,0.0,0.0,9,0.0,0,0.0,0.0,0.0,...,NaN,NaN,0.0,NaN,Tue Jan 01 00:00:00 EST 2013,Tue Jan 01 00:00:00 EST 2013,NaN,0,0,0
2,12.207778,0.0,0.0,0.0,23,0.0,0,0.0,0.0,0.0,...,NaN,NaN,0.0,NaN,Tue Jan 01 00:00:00 EST 2013,Tue Jan 01 00:00:00 EST 2013,NaN,0,0,0
3,29.964545,0.0,0.0,0.0,10,0.0,0,0.0,0.0,0.0,...,NaN,NaN,0.0,NaN,Tue Jan 01 00:00:00 EST 2013,Tue Jan 01 00:00:00 EST 2013,NaN,0,0,0
4,17.347895,0.0,0.0,0.0,17,0.0,0,0.0,0.0,0.0,...,NaN,NaN,0.0,NaN,Tue Jan 01 00:00:00 EST 2013,Tue Jan 01 00:00:00 EST 2013,NaN,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
39096,14.982273,0.0,0.0,0.0,19,0.0,0,0.0,0.0,0.0,...,NaN,NaN,0.0,NaN,Tue Jan 01 00:00:00 EST 2013,Tue Jan 01 00:00:00 EST 2013,NaN,0,0,0
39097,14.330870,0.0,0.0,0.0,20,0.0,0,0.0,0.0,0.0,...,NaN,NaN,0.0,NaN,Tue Jan 01 00:00:00 EST 2013,Tue Jan 01 00:00:00 EST 2013,NaN,0,0,0
39098,15.695714,0.0,0.0,0.0,18,0.0,0,0.0,0.0,0.0,...,NaN,NaN,0.0,NaN,Tue Jan 01 00:00:00 EST 2013,Tue Jan 01 00:00:00 EST 2013,NaN,0,0,0
39099,15.695714,0.0,0.0,0.0,18,0.0,0,0.0,0.0,0.0,...,NaN,NaN,0.0,NaN,Tue Jan 01 00:00:00 EST 2013,Tue Jan 01 00:00:00 EST 2013,NaN,0,0,0
39100,18.311667,0.0,0.0,0.0,16,0.0,0,0.0,0.0,0.0,...,NaN,NaN,0.0,NaN,Tue Jan 01 00:00:00 EST 2013,Tue Jan 01 00:00:00 EST 2013,NaN,0,0,0

In [64]:
autos.modifiedOn.dtype

dtype('O')

In [65]:
autos.modifiedOn

0        Tue Jan 01 00:00:00 EST 2013
1        Tue Jan 01 00:00:00 EST 2013
2        Tue Jan 01 00:00:00 EST 2013
3        Tue Jan 01 00:00:00 EST 2013
4        Tue Jan 01 00:00:00 EST 2013
                     ...
39096    Tue Jan 01 00:00:00 EST 2013
39097    Tue Jan 01 00:00:00 EST 2013
39098    Tue Jan 01 00:00:00 EST 2013
39099    Tue Jan 01 00:00:00 EST 2013
39100    Tue Jan 01 00:00:00 EST 2013
Name: modifiedOn, Length: 39101, dtype: object

In [66]:
pd.to_datetime(autos.modifiedOn)

/Users/taemin/anaconda3/lib/python3.10/site-packages/dateutil/parser/_parser.py:1207: UnknownTimezoneWarning: tzname EST identified but not understood.  Pass `tzinfos` argument in order to correctly return a timezone-aware datetime.  In a future version, this will raise an exception.
  warnings.warn("tzname {tzname} identified but not understood.  "
/Users/taemin/anaconda3/lib/python3.10/site-packages/dateutil/parser/_parser.py:1207: UnknownTimezoneWarning: tzname EDT identified but not understood.  Pass `tzinfos` argument in order to correctly return a timezone-aware datetime.  In a future version, this will raise an exception.
  warnings.warn("tzname {tzname} identified but not understood.  "

0       2013-01-01
1       2013-01-01
2       2013-01-01
3       2013-01-01
4       2013-01-01
           ...
39096   2013-01-01
39097   2013-01-01
39098   2013-01-01
39099   2013-01-01
39100   2013-01-01
Name: modifiedOn, Length: 39101, dtype: datetime64[ns]

In [67]:
import zipfile

In [69]:
with zipfile.ZipFile(
    'data/kaggle-survey-2018.zip'
) as z:
    print('\n'.join(z.namelist()))
    kag = pd.read_csv(
        z.open('multipleChoiceResponses.csv')
    )
    kag_questions = kag.iloc[0]
    survey = kag.iloc[1:]

multipleChoiceResponses.csv
freeFormResponses.csv
SurveySchema.csv

/var/folders/j_/hylrqd052y9czkfmjyyc7n7r0000gn/T/ipykernel_7196/1919468987.py:5: DtypeWarning: Columns (0,2,8,10,21,23,24,25,26,27,28,44,56,64,83,85,87,107,109,123,125,150,157,172,174,194,210,218,219,223,246,249,262,264,276,277,278,279,280,281,282,283,284,285,286,287,288,289,290,304,306,325,326,329,341,368,371,384,385,389,390,391,393,394) have mixed types. Specify dtype option on import or set low_memory=False.
  kag = pd.read_csv(

In [72]:
survey.head(2).T

                                                            1          2
Time from Start to Finish (seconds)                       710        434
Q1                                                     Female       Male
Q1_OTHER_TEXT                                              -1         -1
Q2                                                      45-49      30-34
Q3                                   United States of America  Indonesia
...                                                       ...        ...
Q50_Part_5                                                NaN        NaN
Q50_Part_6                                                NaN        NaN
Q50_Part_7                                                NaN        NaN
Q50_Part_8                                                NaN        NaN
Q50_OTHER_TEXT                                             -1         -1

[395 rows x 2 columns]

데이터베이스와 작업

In [74]:
import sqlite3

In [75]:
con = sqlite3.connect('data/beat.db')

In [87]:
with con:
    cur = con.cursor()
    cur.execute("""DROP TABLE Band""")
    cur.execute(
        """CREATE TABLE Band(id INTEGER PRIMARY KEY,
                            fname TEXT, lname TEXT, birthyear INT)
        """
    )
    cur.execute(
        """INSERT INTO Band VALUES(
            0, 'Paul', 'McCartney', 1942)
        """
    )
    cur.execute(
        """INSERT INTO Band VALUES(
            1, 'John', 'Lennon', 1940)
        """
    )
    _ = con.commit()

In [88]:
import sqlalchemy as sa

In [89]:
engine = sa.create_engine(
    "sqlite:///data/beat.db", echo=True
)

In [90]:
sa_connection = engine.connect()

In [91]:
beat = pd.read_sql(
    "Band", sa_connection, index_col="id"
)

2023-06-16 12:01:31,713 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("Band")
2023-06-16 12:01:31,713 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-06-16 12:01:31,714 INFO sqlalchemy.engine.Engine SELECT name FROM sqlite_master WHERE type='table' ORDER BY name
2023-06-16 12:01:31,714 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-06-16 12:01:31,714 INFO sqlalchemy.engine.Engine PRAGMA main.table_xinfo("Band")
2023-06-16 12:01:31,715 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-06-16 12:01:31,715 INFO sqlalchemy.engine.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type = 'table'
2023-06-16 12:01:31,715 INFO sqlalchemy.engine.Engine [raw sql] ('Band',)
2023-06-16 12:01:31,716 INFO sqlalchemy.engine.Engine PRAGMA main.foreign_key_list("Band")
2023-06-16 12:01:31,716 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-06-16 12:01:31,717 INFO sqlalchemy.engine.Engine PRAGMA temp.foreign_key_list("Band")
2023-06-16 12:01:31,717 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-06-16 12:01:31,717 INFO sqlalchemy.engine.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type = 'table'
2023-06-16 12:01:31,717 INFO sqlalchemy.engine.Engine [raw sql] ('Band',)
2023-06-16 12:01:31,718 INFO sqlalchemy.engine.Engine PRAGMA main.index_list("Band")
2023-06-16 12:01:31,718 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-06-16 12:01:31,718 INFO sqlalchemy.engine.Engine PRAGMA temp.index_list("Band")
2023-06-16 12:01:31,719 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-06-16 12:01:31,719 INFO sqlalchemy.engine.Engine PRAGMA main.index_list("Band")
2023-06-16 12:01:31,719 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-06-16 12:01:31,719 INFO sqlalchemy.engine.Engine PRAGMA temp.index_list("Band")
2023-06-16 12:01:31,720 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-06-16 12:01:31,720 INFO sqlalchemy.engine.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type = 'table'
2023-06-16 12:01:31,720 INFO sqlalchemy.engine.Engine [raw sql] ('Band',)
2023-06-16 12:01:31,721 INFO sqlalchemy.engine.Engine SELECT "Band".id, "Band".fname, "Band".lname, "Band".birthyear
FROM "Band"
2023-06-16 12:01:31,721 INFO sqlalchemy.engine.Engine [generated in 0.00024s] ()

In [92]:
beat

   fname      lname  birthyear
id
0   Paul  McCartney       1942
1   John     Lennon       1940

In [93]:
sql = """SELECT fname, birthyear from Band"""

In [94]:
fnames = pd.read_sql(sql, con)

In [95]:
fnames

  fname  birthyear
0  Paul       1942
1  John       1940

JSON 파일 읽기

In [96]:
import json

In [97]:
encoded = json.dumps(people)

In [98]:
encoded

'{"first": ["Paul", "John", "Richard", "George"], "last": ["McCartney", "Lennon", "Starkey", "Harrison"], "birth": [1941, 1940, 1940, 1943]}'

In [99]:
json.loads(encoded)

{'first': ['Paul', 'John', 'Richard', 'George'],
 'last': ['McCartney', 'Lennon', 'Starkey', 'Harrison'],
 'birth': [1941, 1940, 1940, 1943]}

In [100]:
beatles = pd.read_json(encoded)

In [101]:
beatles

     first       last  birth
0     Paul  McCartney   1941
1     John     Lennon   1940
2  Richard    Starkey   1940
3   George   Harrison   1943

In [102]:
records = beatles.to_json(orient='records')

In [103]:
records

'[{"first":"Paul","last":"McCartney","birth":1941},{"first":"John","last":"Lennon","birth":1940},{"first":"Richard","last":"Starkey","birth":1940},{"first":"George","last":"Harrison","birth":1943}]'

In [104]:
pd.read_json(records, orient='records')

     first       last  birth
0     Paul  McCartney   1941
1     John     Lennon   1940
2  Richard    Starkey   1940
3   George   Harrison   1943

In [105]:
split = beatles.to_json(orient='split')

In [106]:
split

'{"columns":["first","last","birth"],"index":[0,1,2,3],"data":[["Paul","McCartney",1941],["John","Lennon",1940],["Richard","Starkey",1940],["George","Harrison",1943]]}'

In [107]:
index = beatles.to_json(orient='index')

In [108]:
index

'{"0":{"first":"Paul","last":"McCartney","birth":1941},"1":{"first":"John","last":"Lennon","birth":1940},"2":{"first":"Richard","last":"Starkey","birth":1940},"3":{"first":"George","last":"Harrison","birth":1943}}'

In [109]:
pd.read_json(index, orient='index')

     first       last  birth
0     Paul  McCartney   1941
1     John     Lennon   1940
2  Richard    Starkey   1940
3   George   Harrison   1943

In [110]:
values = beatles.to_json(orient='values')

In [111]:
values

'[["Paul","McCartney",1941],["John","Lennon",1940],["Richard","Starkey",1940],["George","Harrison",1943]]'

In [112]:
table = beatles.to_json(orient='table')

In [113]:
table

'{"schema":{"fields":[{"name":"index","type":"integer"},{"name":"first","type":"string"},{"name":"last","type":"string"},{"name":"birth","type":"integer"}],"primaryKey":["index"],"pandas_version":"1.4.0"},"data":[{"index":0,"first":"Paul","last":"McCartney","birth":1941},{"index":1,"first":"John","last":"Lennon","birth":1940},{"index":2,"first":"Richard","last":"Starkey","birth":1940},{"index":3,"first":"George","last":"Harrison","birth":1943}]}'

In [114]:
pd.read_json(table, orient='table')

     first       last  birth
0     Paul  McCartney   1941
1     John     Lennon   1940
2  Richard    Starkey   1940
3   George   Harrison   1943

In [115]:
output = beat.to_dict()

In [116]:
output

{'fname': {0: 'Paul', 1: 'John'},
 'lname': {0: 'McCartney', 1: 'Lennon'},
 'birthyear': {0: 1942, 1: 1940}}

In [117]:
output['version'] = '1.4.0'

In [118]:
json.dumps(output)

'{"fname": {"0": "Paul", "1": "John"}, "lname": {"0": "McCartney", "1": "Lennon"}, "birthyear": {"0": 1942, "1": 1940}, "version": "1.4.0"}'

HTML 테이블 읽기

In [119]:
url ='https://en.wikipedia.org/wiki/The_Beatles_discography'
dfs = pd.read_html(url)
len(dfs)

59

In [120]:
dfs[0]

  The Beatles discography The Beatles discography.1
0     The Beatles in 1965       The Beatles in 1965
1           Studio albums          12 (UK), 17 (US)
2             Live albums                         5
3      Compilation albums                        51
4            Video albums                        22
5            Music videos                        53
6                     EPs                        36
7                 Singles                        63
8                Mash-ups                         2
9                Box sets                        17

In [121]:
url ='https://en.wikipedia.org/wiki/The_Beatles_discography'
dfs = pd.read_html(
    url, match='List of studio albums', na_values='?'
)

In [122]:
len(dfs)

2

In [127]:
dfs[1].columns

MultiIndex([(               'Title',          'Title'),
            (       'Album details',  'Album details'),
            ('Peak chart positions',      'UK [6][7]'),
            ('Peak chart positions',        'AUS [8]'),
            ('Peak chart positions',        'CAN [9]'),
            ('Peak chart positions',       'FRA [10]'),
            ('Peak chart positions',       'GER [11]'),
            ('Peak chart positions',       'NOR [12]'),
            ('Peak chart positions',    'US [13][14]'),
            ('Peak chart positions',    'US Cash Box'),
            (      'Certifications', 'Certifications'),
            (               'Sales',          'Sales')],
           )

In [128]:
url ='https://en.wikipedia.org/wiki/The_Beatles_discography'
dfs = pd.read_html(
    url,
    match='List of studio albums',
    na_values='?',
    header=[0, 1]
)

In [129]:
len(dfs)

2

In [130]:
dfs[0]

                                                Title  \
                                                Title
0                                    Please Please Me
1                                 With the Beatles[A]
2                                  A Hard Day's Night
3                                    Beatles for Sale
4                                               Help!
5                                         Rubber Soul
6                                            Revolver
7               Sgt. Pepper's Lonely Hearts Club Band
8                     The Beatles ("The White Album")
9                                 Yellow Submarine[B]
10                                         Abbey Road
11                                          Let It Be
12  "—" denotes that the recording did not chart o...

                                        Album details  \
                                        Album details
0           Released: 22 March 1963 Label: Parlophone
1   Released: 22 November 1963 Label: Parlophone (...
2            Released: 10 July 1964 Label: Parlophone
3         Released: 4 December 1964 Label: Parlophone
4           Released: 6 August 1965 Label: Parlophone
5         Released: 3 December 1965 Label: Parlophone
6           Released: 5 August 1966 Label: Parlophone
7   Released: 26 May 1967 Label: Parlophone (UK), ...
8             Released: 22 November 1968 Label: Apple
9   Released: 13 January 1969 Label: Apple (UK), C...
10           Released: 26 September 1969 Label: Apple
11                  Released: 8 May 1970 Label: Apple
12  "—" denotes that the recording did not chart o...

                                 Peak chart positions  \
                                            UK [6][7]
0                                                   1
1                                                   1
2                                                   1
3                                                   1
4                                                   1
5                                                   1
6                                                   1
7                                                   1
8                                                   1
9                                                   3
10                                                  1
11                                                  1
12  "—" denotes that the recording did not chart o...

                                                       \
                                              AUS [8]
0                                                   —
1                                                   —
2                                                   1
3                                                   1
4                                                   1
5                                                   1
6                                                   1
7                                                   1
8                                                   1
9                                                   4
10                                                  1
11                                                  1
12  "—" denotes that the recording did not chart o...

                                                       \
                                              CAN [9]
0                                                   —
1                                                   —
2                                                   —
3                                                   —
4                                                   —
5                                                   —
6                                                   —
7                                                   1
8                                                   1
9                                                   1
10                                                  1
11                                                  1
12  "—" denotes that the recording did not chart o...

                                                       \
                                             FRA [10]
0                                                   5
1                                                   5
2                                                   —
3                                                   —
4                                                   5
5                                                   5
6                                                   5
7                                                   4
8                                                   1
9                                                   4
10                                                  1
11                                                  5
12  "—" denotes that the recording did not chart o...

                                                       \
                                             GER [11]
0                                                   5
1                                                   1
2                                                   1
3                                                   1
4                                                   1
5                                                   1
6                                                   1
7                                                   1
8                                                   1
9                                                   5
10                                                  1
11                                                  4
12  "—" denotes that the recording did not chart o...

                                                       \
                                             NOR [12]
0                                                   —
1                                                   —
2                                                   —
3                                                   —
4                                                   —
5                                                   —
6                                                  14
7                                                   1
8                                                   1
9                                                   1
10                                                  1
11                                                  1
12  "—" denotes that the recording did not chart o...

                                                       \
                                          US [13][14]
0                                                   —
1                                                   —
2                                                   —
3                                                   —
4                                                   —
5                                                   —
6                                                   —
7                                                   1
8                                                   1
9                                                   2
10                                                  1
11                                                  1
12  "—" denotes that the recording did not chart o...

                                       Certifications  \
                                       Certifications
0   BPI: Platinum[15] ARIA: Gold[16] MC: Gold[17] ...
1   BPI: Gold[15] ARIA: Gold[16] BVMI: Gold[19] MC...
2                    BPI: Platinum[15] ARIA: Gold[16]
3   BPI: Gold[15] ARIA: Gold[16] MC: Gold[17] RIAA...
4                    BPI: Platinum[15] ARIA: Gold[16]
5   BPI: 2× Platinum[15] ARIA: Platinum[16] BVMI: ...
6             BPI: 2× Platinum[15] ARIA: Platinum[16]
7   BPI: 18× Platinum[15] ARIA: 4× Platinum[16] BV...
8   BPI: 2× Platinum[15] ARIA: 2× Platinum[16] MC:...
9       BPI: Gold[15] MC: Gold[17] RIAA: Platinum[18]
10  BPI: 8× Platinum[15] ARIA: 3× Platinum[16] BVM...
11  BPI: Platinum[15] ARIA: Platinum[16] MC: 3× Pl...
12  "—" denotes that the recording did not chart o...

                                                Sales
                                                Sales
0                                                 NaN
1                                                 NaN
2                                                 NaN
3                                     UK: 750,000[20]
4                                                 NaN
5                                                 NaN
6                                                 NaN
7                                   UK: 5,340,000[22]
8                                                 NaN
9                                                 NaN
10                                  UK: 2,240,608[24]
11                                                NaN
12  "—" denotes that the recording did not chart o...

In [141]:
dfs[0].columns

MultiIndex([(               'Title',          'Title'),
            (       'Album details',  'Album details'),
            ('Peak chart positions',      'UK [6][7]'),
            ('Peak chart positions',        'AUS [8]'),
            ('Peak chart positions',        'CAN [9]'),
            ('Peak chart positions',       'FRA [10]'),
            ('Peak chart positions',       'GER [11]'),
            ('Peak chart positions',       'NOR [12]'),
            ('Peak chart positions',    'US [13][14]'),
            (      'Certifications', 'Certifications'),
            (               'Sales',          'Sales')],
           )

In [142]:
df = dfs[0]

In [144]:
df.columns = [
    'Title',
    'Release',
    'UK',
    'AUS',
    'CAN',
    'FRA',
    'GER',
    'NOR',
    'US',
    'Certifications'
    'Sales'
]

ValueError: Length mismatch: Expected axis has 11 elements, new values have 10 elements

In [145]:
res = (
    df.pipe(
        lambda df_: df_[
            ~df_.Title.str.startswith('Released')
        ]
    )
)
res

AttributeError: 'DataFrame' object has no attribute 'str'